const myQuotation = [
    'کسی که مبارزه کند، ممکن است شکست بخورد، ولی آنکه مبارزه نکند، شکست خورده هست(برتولت برشت)',
    'ما ندرتأ در باره آنچه که داریم فکر می‌کنیم، درحالیکه پیوسته در اندیشه چیزهائی هستیم که نداریم.(آرتور شوپنهاور)',
    'سخت ترین کار دنیا ادامه دادنِ ، پس ادامه بده (حسن هاشمی) ',
    'آدمیایی که فقط خدا پارتی شون هست فقط باید تلاش کنن (حسن هاشمی)',
    'مرد بزرگ بر خود سخت میگیرد مرد کوچک بر دیگران (کنففوسیوس)',
    'هیچ کس را سرزنش نکنید ، از هیچکس انتظار نداشته باشید ، خودتان کاری بکنید (تام پیترز)',
    'ناکامی های ما همواره از بهانه هایی که برای توجیح کردن آنها می آوریم بخشش پذیر ترند (لاروشفوکو)',
    'سرباز ینی کسی که خودش را تسخیر می کند ',
    'روزی فدریک کبیر امپراتور روس ، در اطراف برلین قدم می زد که با مردی بسیارپیر که  مثل شاخ شمشاد از جهت مخالف می آمد رو به رو شد .فدریک از او پرسید : تو کیستی ؟ پیرمرد پاسخ داد : من یک پادشاه هستم فدریک خندید و گفت : یک پادشاه قلمرو سلطنت تو کجاست ؟ پیرمرد مغرور پاسخ داد : خودم هر یک از ما سلطان و شاه زندگی خود هستیم ',
    'موفقیت یعنی ادامه دادن، حتی وقتی انگیزه‌ای نداری.',
    'گاهی فقط یک تصمیم کوچک می‌تونه مسیر کل زندگی رو عوض کنه.',
    'اگر خسته شدی، استراحت کن؛ اما تسلیم نشو.',
    'هیچ‌کس با کامل بودن شروع نکرده، همه با تلاش به جلو رفتن.',
    'زندگی همیشه طبق برنامه پیش نمی‌ره، ولی همیشه می‌شه ادامه داد.',
    'یه روز کارمون میگیره '
];

const button = document.querySelector('.quotation-change-btn');
const quotation = document.querySelector('.quotation-box-p');
button.addEventListener("click", () => {
    const random = Math.floor(Math.random() * myQuotation.length);
    quotation.textContent = myQuotation[random];
});

function showRandomQuote() {
    const randomQuote = Math.floor(Math.random() * myQuotation.length);
    document.querySelector('.random-quotation').textContent = myQuotation[randomQuote];
}

setInterval(showRandomQuote, 5000);

